In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### Create DataFrame with datetimeindex

In [5]:
dates = pd.date_range("20130101", periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [8]:
df

                   A         B         C         D
2013-01-01  1.021906 -1.577913 -0.774564  0.375030
2013-01-02  1.194450 -0.505797  0.179282  2.119827
2013-01-03 -0.447943  0.100016  0.747111  0.205349
2013-01-04  0.351945  0.583041  3.553290  3.410470
2013-01-05  0.299034 -0.771784  0.190140 -0.360190
2013-01-06 -0.149658  0.006311 -0.380132  1.698148

In [9]:
df2 = pd.DataFrame(
  {
    "A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo"
  }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

## Viewing Data

In [11]:
df.head()

                   A         B         C         D
2013-01-01  1.021906 -1.577913 -0.774564  0.375030
2013-01-02  1.194450 -0.505797  0.179282  2.119827
2013-01-03 -0.447943  0.100016  0.747111  0.205349
2013-01-04  0.351945  0.583041  3.553290  3.410470
2013-01-05  0.299034 -0.771784  0.190140 -0.360190

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.351945  0.583041  3.553290  3.410470
2013-01-05  0.299034 -0.771784  0.190140 -0.360190
2013-01-06 -0.149658  0.006311 -0.380132  1.698148

In [13]:
df.to_numpy()

array([[ 1.02190634, -1.57791321, -0.77456372,  0.37503001],
       [ 1.19444968, -0.50579738,  0.17928244,  2.11982689],
       [-0.44794288,  0.10001619,  0.74711088,  0.20534882],
       [ 0.35194478,  0.58304142,  3.55328966,  3.41047011],
       [ 0.29903422, -0.77178438,  0.19013959, -0.36019005],
       [-0.14965788,  0.00631105, -0.3801315 ,  1.69814838]])

In [14]:
df[1:3]

                   A         B         C         D
2013-01-02  1.194450 -0.505797  0.179282  2.119827
2013-01-03 -0.447943  0.100016  0.747111  0.205349